In [1]:
import numpy as np
import pandas as pd

In [3]:
# using lists

student_data =[
    [100,73,75,83],
    [74,84,94,73],
    [73,63,72,83],
    [63,72,98,82]
]
data = pd.DataFrame(student_data,columns=['id','marks','packages','age'])

In [5]:
data.shape

(4, 4)

In [7]:
data

    id  marks  packages  age
0  100     73        75   83
1   74     84        94   73
2   73     63        72   83
3   63     72        98   82

In [23]:
data.head(2)

    id  marks  packages  age
0  100     73        75   83
1   74     84        94   73

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        4 non-null      int64
 1   marks     4 non-null      int64
 2   packages  4 non-null      int64
 3   age       4 non-null      int64
dtypes: int64(4)
memory usage: 260.0 bytes

In [27]:
data.describe()

               id      marks   packages        age
count    4.000000   4.000000   4.000000   4.000000
mean    77.500000  73.000000  84.750000  80.250000
std     15.800844   8.602325  13.149778   4.856267
min     63.000000  63.000000  72.000000  73.000000
25%     70.500000  69.750000  74.250000  79.750000
50%     73.500000  72.500000  84.500000  82.500000
75%     80.500000  75.750000  95.000000  83.000000
max    100.000000  84.000000  98.000000  83.000000

In [29]:
data.isnull().sum()

id          0
marks       0
packages    0
age         0
dtype: int64

In [31]:
data.duplicated().sum()

0

In [33]:
data.dtypes

id          int64
marks       int64
packages    int64
age         int64
dtype: object

In [37]:
data.iloc[0:2]

    id  marks  packages  age
0  100     73        75   83
1   74     84        94   73

In [43]:
data.loc[1]

id          74
marks       84
packages    94
age         73
Name: 1, dtype: int64

In [45]:
data

    id  marks  packages  age
0  100     73        75   83
1   74     84        94   73
2   73     63        72   83
3   63     72        98   82

In [49]:
data['id'][1]

74

In [51]:
data['marks'] == 84

0    False
1     True
2    False
3    False
Name: marks, dtype: bool

In [53]:
data['con'] = 'ina'

In [55]:
data

    id  marks  packages  age  con
0  100     73        75   83  ina
1   74     84        94   73  ina
2   73     63        72   83  ina
3   63     72        98   82  ina

In [57]:
data['marks'][1] = 22

C:\Users\DELL\AppData\Local\Temp\ipykernel_12172\3019959922.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  data['marks'][1] = 22
C:\Users\DELL\AppData\Local\Temp\ipykernel_12172\3019959922.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['marks'][1] = 22

In [59]:
data

    id  marks  packages  age  con
0  100     73        75   83  ina
1   74     22        94   73  ina
2   73     63        72   83  ina
3   63     72        98   82  ina

In [ ]:
# (pipe line) 
#data phele load karte hai 2. data ko cli